/*************************************************************************
	> File Name: ep25.c
	> Author: 
	> Mail: 
	> Created Time: 2019年12月22日 星期日 14时11分20秒
 ************************************************************************/

#include<stdio.h>
#define max_n 1000

int f[3][max_n + 5];

int main(){
    int n = 2;
    f[1][0] = 1;//f[1][0]  是位数;
    f[1][1] = 1;// f[1][1]是当前数据
    f[2][0] = 1;
    f[2][1] = 1;
    /*while(floor(log10(f[n % 3])) + 1)*/ //小数据做法
    while(f[n % 3][0] < 1000) {
        n++;
        int *a = f[n % 3], *b = f[(n - 1) % 3] , *c = f[(n - 2) % 3];
        for(int i = 1 ; i <= b[0]; i++){
            a[i] = b[i] + c[i];
        }
        a[0] = b[0];
        for(int i = 1; i <= a[0]; i++){
            if(a[i] < 10) continue;
            a[i + 1] += a[i] / 10;
            a[i] %= 10;
            a[0] += (a[0] == i);
        }
    }
    printf("%d\n",n);
    return 0;
}
